; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v10)
             (pred_6 ?v2 ?v12)
             (pred_10 ?v5 ?v12)
             (pred_9 ?v3 ?v5 )
	     (pred_2 ?v5)
             (pred_11 ?v4)
             (pred_5 ?v2)
             (pred_1 ?v12)
             (pred_3 ?v5)
             (pred_12 ?v2)
             (pred_4 ?v5)
             (pred_8 ))



(:action op_3
:parameters (?v11 ?v8 ?v1 ?v7)
:precondition (and (pred_11 ?v11) (pred_11 ?v8) (pred_5 ?v1) (pred_1 ?v7)
          (pred_7 ?v11 ?v8) (pred_6 ?v1 ?v7)
                   (pred_10 ?v8 ?v7) (pred_2 ?v11) 
                   (pred_3 ?v8) (pred_12 ?v1))
:effect (and  (pred_4 ?v8) (not (pred_3 ?v8))))


(:action op_5
:parameters (?v11 ?v9)
:precondition (and (pred_11 ?v11) (pred_11 ?v9)
               (pred_2 ?v11) (pred_7 ?v11 ?v9) (pred_4 ?v9))
:effect (and (pred_2 ?v9) (not (pred_2 ?v11))))

(:action op_2
:parameters (?v11 ?v1)
:precondition (and (pred_11 ?v11) (pred_5 ?v1) 
                  (pred_2 ?v11) (pred_9 ?v1 ?v11) (pred_8 ))
:effect (and (pred_12 ?v1)
   (not (pred_9 ?v1 ?v11)) (not (pred_8 ))))


(:action op_4
:parameters (?v11 ?v13 ?v6)
:precondition (and (pred_11 ?v11) (pred_5 ?v13) (pred_5 ?v6)
                  (pred_2 ?v11) (pred_12 ?v6) (pred_9 ?v13 ?v11))
:effect (and (pred_12 ?v13) (pred_9 ?v6 ?v11)
        (not (pred_12 ?v6)) (not (pred_9 ?v13 ?v11))))

(:action op_1
:parameters (?v11 ?v1)
:precondition (and (pred_11 ?v11) (pred_5 ?v1) 
                  (pred_2 ?v11) (pred_12 ?v1))
:effect (and (pred_8 ) (pred_9 ?v1 ?v11) (not (pred_12 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_04 obj_08 obj_07 obj_09 obj_01 obj_11 obj_23 obj_10 obj_19 obj_15 obj_30 obj_22 obj_18 obj_21 obj_25 obj_29 obj_12 obj_16 obj_05 obj_14 obj_20 obj_06 obj_02 obj_27
    obj_17 obj_26
    obj_13 obj_24 obj_28
    )

    (:init
       (pred_8)

       (pred_11 obj_03)
       (pred_11 obj_04)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_11 obj_11)
       (pred_11 obj_23)
       (pred_11 obj_10)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_30)
       (pred_11 obj_22)
       (pred_11 obj_18)
       (pred_11 obj_21)
       (pred_11 obj_25)
       (pred_11 obj_29)
       (pred_11 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_05)
       (pred_11 obj_14)
       (pred_11 obj_20)
       (pred_11 obj_06)
       (pred_11 obj_02)
       (pred_11 obj_27)
       (pred_1 obj_17)
       (pred_1 obj_26)
       (pred_5 obj_13)
       (pred_5 obj_24)
       (pred_5 obj_28)

       (pred_7 obj_03 obj_01)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_08 obj_23)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_07 obj_10)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_07 obj_08)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_11 obj_30)
       (pred_7 obj_11 obj_23)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_23 obj_22)
       (pred_7 obj_23 obj_10)
       (pred_7 obj_23 obj_08)
       (pred_7 obj_23 obj_11)
       (pred_7 obj_10 obj_18)
       (pred_7 obj_10 obj_19)
       (pred_7 obj_10 obj_07)
       (pred_7 obj_10 obj_23)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_19 obj_10)
       (pred_7 obj_15 obj_25)
       (pred_7 obj_15 obj_30)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_30 obj_29)
       (pred_7 obj_30 obj_22)
       (pred_7 obj_30 obj_11)
       (pred_7 obj_30 obj_15)
       (pred_7 obj_22 obj_12)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_22 obj_23)
       (pred_7 obj_22 obj_30)
       (pred_7 obj_18 obj_16)
       (pred_7 obj_18 obj_21)
       (pred_7 obj_18 obj_10)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_21 obj_18)
       (pred_7 obj_25 obj_14)
       (pred_7 obj_25 obj_29)
       (pred_7 obj_25 obj_15)
       (pred_7 obj_29 obj_20)
       (pred_7 obj_29 obj_12)
       (pred_7 obj_29 obj_30)
       (pred_7 obj_29 obj_25)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_12 obj_16)
       (pred_7 obj_12 obj_22)
       (pred_7 obj_12 obj_29)
       (pred_7 obj_16 obj_02)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_18)
       (pred_7 obj_16 obj_12)
       (pred_7 obj_05 obj_27)
       (pred_7 obj_05 obj_21)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_14 obj_20)
       (pred_7 obj_14 obj_25)
       (pred_7 obj_20 obj_06)
       (pred_7 obj_20 obj_29)
       (pred_7 obj_20 obj_14)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_02 obj_27)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_27 obj_05)
       (pred_7 obj_27 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_06)
       (pred_3 obj_29)
       (pred_10  obj_11 obj_17)
       (pred_10  obj_06 obj_26)
       (pred_10  obj_29 obj_26)
       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_4 obj_08)
       (pred_4 obj_07)
       (pred_4 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_23)
       (pred_4 obj_10)
       (pred_4 obj_19)
       (pred_4 obj_15)
       (pred_4 obj_30)
       (pred_4 obj_22)
       (pred_4 obj_18)
       (pred_4 obj_21)
       (pred_4 obj_25)
       (pred_4 obj_12)
       (pred_4 obj_16)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_4 obj_20)
       (pred_4 obj_02)
       (pred_4 obj_27)

       (pred_6  obj_13 obj_17)
       (pred_6  obj_24 obj_26)
       (pred_6  obj_28 obj_17)
       (pred_9 obj_13 obj_21)
       (pred_9 obj_24 obj_04)
       (pred_9 obj_28 obj_30)
       (pred_2 obj_25)
    )

    (:goal (and
       (pred_9 obj_13 obj_11)
       (pred_9 obj_24 obj_06)
       (pred_9 obj_28 obj_09)
    ))
(:constraints
  (always (not (pred_2 obj_10)))
)
)

; plan
1. (op_5 obj_25 obj_15)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_15)
   goals met: 0 of 3
2. (op_5 obj_15 obj_30)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_30)
   goals met: 0 of 3
3. (op_2 obj_30 obj_28)
   deleted: (pred_9 obj_28 obj_30) (pred_8)
   added: (pred_12 obj_28)
   goals met: 0 of 3
4. (op_3 obj_30 obj_11 obj_28 obj_17)
   deleted: (pred_3 obj_11)
   added: (pred_4 obj_11)
   goals met: 0 of 3
5. (op_5 obj_30 obj_11)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_11)
   goals met: 0 of 3
6. (op_5 obj_11 obj_04)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_04)
   goals met: 0 of 3
7. (op_5 obj_04 obj_08)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_08)
   goals met: 0 of 3
8. (op_5 obj_08 obj_07)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_07)
   goals met: 0 of 3
9. (op_5 obj_07 obj_09)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_09)
   goals met: 0 of 3
10. (op_1 obj_09 obj_28)
   deleted: (pred_12 obj_28)
   added: (pred_8) (pred_9 obj_28 obj_09)
   goals met: 1 of 3
11. (op_5 obj_09 obj_07)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_07)
   goals met: 1 of 3
12. (op_5 obj_07 obj_08)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_08)
   goals met: 1 of 3
13. (op_5 obj_08 obj_04)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_04)
   goals met: 1 of 3
14. (op_2 obj_04 obj_24)
   deleted: (pred_9 obj_24 obj_04) (pred_8)
   added: (pred_12 obj_24)
   goals met: 1 of 3
15. (op_5 obj_04 obj_11)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_11)
   goals met: 1 of 3
16. (op_5 obj_11 obj_30)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_30)
   goals met: 1 of 3
17. (op_5 obj_30 obj_22)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_22)
   goals met: 1 of 3
18. (op_5 obj_22 obj_12)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_12)
   goals met: 1 of 3
19. (op_3 obj_12 obj_06 obj_24 obj_26)
   deleted: (pred_3 obj_06)
   added: (pred_4 obj_06)
   goals met: 1 of 3
20. (op_5 obj_12 obj_06)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_06)
   goals met: 1 of 3
21. (op_1 obj_06 obj_24)
   deleted: (pred_12 obj_24)
   added: (pred_8) (pred_9 obj_24 obj_06)
   goals met: 2 of 3
22. (op_5 obj_06 obj_02)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_02)
   goals met: 2 of 3
23. (op_5 obj_02 obj_16)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_16)
   goals met: 2 of 3
24. (op_5 obj_16 obj_18)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_18)
   goals met: 2 of 3
25. (op_5 obj_18 obj_21)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_21)
   goals met: 2 of 3
26. (op_2 obj_21 obj_13)
   deleted: (pred_9 obj_13 obj_21) (pred_8)
   added: (pred_12 obj_13)
   goals met: 2 of 3
27. (op_5 obj_21 obj_18)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_18)
   goals met: 2 of 3
28. (op_5 obj_18 obj_22)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_22)
   goals met: 2 of 3
29. (op_5 obj_22 obj_23)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_23)
   goals met: 2 of 3
30. (op_5 obj_23 obj_11)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_11)
   goals met: 2 of 3
31. (op_1 obj_11 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_8) (pred_9 obj_13 obj_11)
   goals met: 3 of 3
